In [2]:
import pandas as pd
import numpy as np

### reindex

In [3]:
obj = pd.Series([4.5, 6.2, 9.1, 8.8], index = ['d', 'c', 'a', 'b'])
obj

d    4.5
c    6.2
a    9.1
b    8.8
dtype: float64

In [4]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a    9.1
b    8.8
c    6.2
d    4.5
e    0.0
dtype: float64

In [5]:
obj_2 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj_2.reindex(range(6), method = 'ffill')
# ffill - fill values forward
# bfill - fill values backward

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [6]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                     index = ['a', 'c', 'd'], 
                     columns = ['Wuhan', 'Beijing', 'Guangzhou'])
frame

   Wuhan  Beijing  Guangzhou
a      0        1          2
c      3        4          5
d      6        7          8

In [7]:
frame.reindex(['a', 'b', 'c', 'd'], method = 'bfill')

   Wuhan  Beijing  Guangzhou
a      0        1          2
b      3        4          5
c      3        4          5
d      6        7          8

In [8]:
frame.reindex(columns = ['Wuhan', 'Guangzhou', 'Beijing', 'Hangzhou'])

   Wuhan  Guangzhou  Beijing  Hangzhou
a      0          2        1       NaN
c      3          5        4       NaN
d      6          8        7       NaN

### drop

In [10]:
obj.drop('c')  # drop entries without modifying the original data

d    4.5
a    9.1
b    8.8
dtype: float64

In [13]:
frame.drop('c')  # DataFrame drop

   Wuhan  Beijing  Guangzhou
a      0        1          2
d      6        7          8

In [14]:
frame.drop(['Beijing', 'Guangzhou'], axis = 1)

   Wuhan
a      0
c      3
d      6

### indexing, selection, filtering

In [19]:
frame_2 = frame.reindex(['a', 'b', 'c', 'd'], 
                        columns = ['Wuhan', 'Beijing', 'Guangzhou', 'Hangzhou'], 
                        fill_value = 0)
frame_2

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0
c      3        4          5         0
d      6        7          8         0

In [27]:
frame_2[['Wuhan', 'Beijing']]

   Wuhan  Beijing
a      0        1
b      0        0
c      3        4
d      6        7

In [28]:
frame_2.loc[['a', 'b']]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [43]:
frame_2.iloc[:2]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [32]:
frame_2[frame_2['Wuhan'] == 0]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [47]:
frame_2[frame_2 == 0] = 9
frame_2

   Wuhan  Beijing  Guangzhou  Hangzhou
a      9        1          2         9
b      9        9          9         9
c      3        4          5         9
d      6        7          8         9

In [54]:
frame_2.loc[:'b', ['Wuhan', 'Beijing']]

   Wuhan  Beijing
a      9        1
b      9        9